package theme

// MechTheme 机械风格主题
var MechTheme = Theme{
	// 第一部分 - 钢铁机械风格
	ThemePart{
		"env":   {"333333"},
		"clo":   {"555555", "777777", "333333"},
		"head":  {"888888"},
		"mouth": {"222222", "555555"},
		"eyes":  {"333333", "73e8ff"},
		"top":   {"444444", "777777", "222222", "555555"},
	},
	// 第二部分 - 铜色机械风格
	ThemePart{
		"env":   {"251607"},
		"clo":   {"805723", "ab752f", "553211"},
		"head":  {"a87e45"},
		"mouth": {"302013", "604020"},
		"eyes":  {"553211", "73e8ff"},
		"top":   {"805723", "ab752f", "302013", "604020"},
	},
	// 第三部分 - 未来机械风格
	ThemePart{
		"env":   {"002244"},
		"clo":   {"1a1a1a", "333333", "007acc"},
		"head":  {"444444"},
		"mouth": {"1a1a1a", "007acc"},
		"eyes":  {"1a1a1a", "00ffff"},
		"top":   {"1a1a1a", "333333", "007acc", "00aaff"},
	},
}
